web/app/views/pilots/laps.html.haml

  %tbody
    - @pilot.pilot_race_laps.order("id DESC").each do |lap_entry|
---
SELECT "pilot_race_laps".* FROM "pilot_race_laps" WHERE "pilot_race_laps"."pilot_id" = ?  ORDER BY id DESC  [["pilot_id", 1]]