web/app/controllers/pilots_controller.rb

  def index
    @pilots = Pilot.order("name ASC")
---
SELECT "pilots".* FROM "pilots" WHERE "pilots"."deleted_at" IS NULL  ORDER BY name ASC

  def laps
    @pilot = Pilot.find(params[:id])
---
SELECT  "pilots".* FROM "pilots" WHERE "pilots"."deleted_at" IS NULL AND "pilots"."id" = ? LIMIT 1  [["id", 1]]