web/app/controllers/system_controller.rb

  def start_race_session
    if !RaceSession::get_open_session
      @race_session = RaceSession.new(strong_params_race_session)
      @race_session.active = true
      @race_session.save
---
INSERT INTO "race_sessions" ("title", "active", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Easy Race"], ["active", "t"], ["created_at", "2015-11-07 15:17:41.246421"], ["updated_at", "2015-11-07 15:17:41.246421"]]

  def stop_race_session
    @race_session = RaceSession::get_open_session
    if @race_session
      @race_session.update_attribute(:active,false)
---
UPDATE `race_sessions` SET `active` = 0, `updated_at` = '2015-10-28 20:49:12' WHERE `race_sessions`.`id` = 1

  def update_style
    @style_setting.update_attributes(strong_params_style_settings)
---
UPDATE "style_settings" SET "own_logo_image" = ?, "updated_at" = ? WHERE "style_settings"."id" = ?  [["own_logo_image", "airbirds_weblogo_200.png"], ["updated_at", "2015-11-07 15:15:52.828086"], ["id", 1]]