web/app/controllers/system/pilot_controller.rb

  def index
    @pilot_prototype = Pilot.new

    @pilots = Pilot.order("name ASC")
---
SELECT `pilots`.* FROM `pilots` WHERE `pilots`.`deleted_at` IS NULL  ORDER BY name ASC

  def edit
    @pilot = Pilot.find(params[:id])
---
SELECT  "pilots".* FROM "pilots" WHERE "pilots"."deleted_at" IS NULL AND "pilots"."id" = ? LIMIT 1  [["id", 1]]

  def update
    @pilot = Pilot.find(params[:id])
    if !@pilot.update_attributes(strong_params_pilot)
---
SELECT  "pilots".* FROM "pilots" WHERE "pilots"."deleted_at" IS NULL AND "pilots"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "pilots" SET "transponder_token" = ? WHERE "pilots"."id" = ?  [["transponder_token", "13"], ["id", 1]]

  def deactivate_token
    @pilot = Pilot.find(params[:id])
    @pilot.update_attribute(:transponder_token, "")
---
SELECT  "pilots".* FROM "pilots" WHERE "pilots"."deleted_at" IS NULL AND "pilots"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "pilots" SET "transponder_token" = ? WHERE "pilots"."id" = ?  [["transponder_token", ""], ["id", 1]]

  def delete
    @pilot = Pilot.find(params[:id])
    @pilot.transponder_token = nil
    @pilot.save(validate: false)
---
SELECT  `pilots`.* FROM `pilots` WHERE `pilots`.`deleted_at` IS NULL AND `pilots`.`id` = 1 LIMIT 1
UPDATE `pilots` SET `pilots`.`deleted_at` = '2015-10-28 20:35:05' WHERE `pilots`.`id` = 1

  def create
    @pilot = Pilot.new(strong_params_pilot)
    if !@pilot.save
---
INSERT INTO "pilots" ("name", "transponder_token", "quad") VALUES (?, ?, ?)  [["name", "Jon Doe"], ["transponder_token", "13"], ["quad", "ZMR 250"]]