web/app/controllers/api/v1/lap_track_controller.rb

  def create

    @race_session =  RaceSession::get_open_session

    # there's no active race session
    if !@race_session
      render status: 409, text: 'no running race session'
      return
    end

    if params[:transponder_token].blank? || params[:lap_time_in_ms].blank?
      render status: 409, text: "one or more tracking params are blank: #{params.inspect}"
      return
    end

    @pilot = Pilot.where(transponder_token: params[:transponder_token]).first
---
SELECT  "pilots".* FROM "pilots" WHERE "pilots"."deleted_at" IS NULL AND "pilots"."transponder_token" = ?  ORDER BY "pilots"."id" ASC LIMIT 1  [["transponder_token", "11"]]